Anuruddhacha/ip_cam_esp32/sdkconfig.defaults
# ===== ESP32-CAM (AI-Thinker) board defaults =====
CONFIG_IDF_TARGET="esp32"

# 4 MB flash (AI-Thinker ESP32-CAM)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Larger single-app partition so the camera + wifi + http server fit
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Enable external PSRAM (required for SVGA+ JPEG frame buffers)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Run the CPU at full speed for smoother streaming
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_240=y

# A bit more main-task stack headroom
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
